[{
  "_id": {
    "$oid": "66e034c674dce48545f70c32"
  },
  "language": "English",
  "parent": "Nouns",
  "name": "Types",
  "text": "Nouns are types of words that denote people, animals, objects, events, abstract concepts, feelings and states.\nThey can have the function of subject or object and can be additionally defined by adjectives and articles.\n\n<strong>1. Proper nouns </strong>\nThey indicate the names of people, countries, places\nExamples: Tom, Spain, Paris\n\n<strong>2. Common nouns </strong>\nThey indicate the names of beings, phenomena and objects\nExamples: mother, singer, car, rabbit, table\n\n<strong>3. Collective nouns </strong>\nThey denote several beings or objects as one unit\nExamples: herd, team, flock\n\n<strong>4. Abstract nouns </strong>\nThey denote something that is intangible\nExamples: love, hapiness, death\n\n<strong>5. Gerund </strong>\nThey indicate the names of actions and states.\nThey have the form of a verb (continuation of the present participle -ing), but they have the function of nouns.\nExamples: walking, watching"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c33"
  },
  "language": "English",
  "parent": "Nouns",
  "name": "Plural",
  "text": "<strong>In general</strong>\n\nMost often, plural nouns in English are formed by adding the suffix -s to an existing singular noun.\nHowever, there are examples where different plural rules apply based on the sound the noun ends with.\nAlso, there are examples of irregular plurals where the rules for adding suffixes do not apply, but simply have to be memorized.\n\n<strong>Different construction methods</strong>\n\nWriting the plural form depends on how the singular noun ends.\n\n<strong>1.</strong> To make the correct plural form, add -s to the noun.\n\nwall - walls\nbridge - bridges\n\n<strong>2.</strong> If the singular noun ends in -s, -sh, -ch, -x, or -z, add -es to the noun to make it plural.\n\nkiss - kisses\nbus - buses\nbrush - brushes\nlunch - lunches\nbox - boxes\n\n<strong>3.</strong> If the noun ends in -f or -fe, the f is usually replaced by -ve before adding the suffix -s to make the noun plural.\n\nlife - lives\nwolf – wolves\n\nHowever, there are exceptions where this rule does not apply:\nroof - roofs\nbelief - beliefs\nchef - chefs\nchief - chiefs\n\n<strong>4.</strong> If the singular noun ends in -y, and there is a consonant before -y, the suffix -ies is added instead of -y.\n\ncity ​​- cities\npuppy - puppies\n\n<strong>5.</strong> If the singular noun ends in -y, and the -y is preceded by a vowel, we just add the suffix -s without any changes to the base.\n\nkey - keys\nboy - boys\n\n<strong>6.</strong> If the noun ends in -o, we add -es to make it plural.\n\npotato - potatoes\ntomato - tomatoes\n\nExceptions:\nphoto - photos\npiano - pianos\n\n<strong>7.</strong> As for the noun volcano, we can apply the rule or simply add the suffix -s. Both versions are correct.\n\nvolcanoes\nvolcanoes\n\n<strong>Irregular plural</strong>\n\n<strong>1.</strong> There are nouns whose plural is not formed by adding a suffix to the singular, but a completely new word is used.\n\nchild - children\ngoose - geese\nman - man\nwoman – women\ntooth - teeth\nfoot - feet\nmouse – mice\n\n<strong>2.</strong> Some nouns have the same form for singular and plural.\n\nsheep - sheep\nseries - series\nspecies - species\ndeer - deer"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c34"
  },
  "language": "English",
  "parent": "Nouns",
  "name": "Countable/Uncountable",
  "text": "<strong>Countable nouns</strong>\n\nExamples: seven cats, nine books, a few friends, some oranges, three girls\n\nIf a countable noun is singular, it is followed by a singular verb.\n\nThere IS one park near my school.\n\nIf a countable noun is plural, it is followed by a plural verb.\n\nThere ARE two parks near my school.\n\n<strong>Uncountable nouns</strong>\n\nUncountable nouns include constructive and abstract nouns.\n\nExamples of uncountable nouns: sand, wood, water, air, rice, coffee...\n\nWe cannot have three waters, but only three drops, three glasses, bottles of water.\nThe noun water is uncountable, while the nouns drop, glass, bottle are countable.\n\nExamples of abstract nouns: happiness, hate, boredom, apathy, excitement..."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c35"
  },
  "language": "English",
  "parent": "Verbs",
  "name": "Tenses",
  "text": "<strong>Basic tenses</strong>\n\n<strong>Past Simple</strong>\n\nWhen used:\n\nThe past simple tense is the past tense in English that is used for actions or states that happened and ended in the past.\nFor example:\n• I went to the cinema yesterday.\n\nFor regular verbs, the past simple is formed by adding the suffix -ed to the base form of the verb (the infinitive without to).\nFor example:\n• play - played\n• study - studied\n• watch - watched\n\nFor irregular verbs, the past simple is built by using a special form of the verb found in the second column of the irregular verb table.\nFor example:\n• go - went\n• see - saw\n• write - wrote\n\nFor the negative and interrogative form, the auxiliary verb did in the past tense is used.The main verb returns to its base form.\nFor example:\n• Did you play tennis yesterday?\n• I didn't watch TV last night.\n\n<strong>Present Simple</strong>\n\nWhen we use the Present Simple:\n\n1. When we talk about an action that is repeated in certain time intervals\n\nI go to work every day.\nJane waters her plants once a week.\n\nYou will often notice adverbs of time such as:\nalways\noften\nusually\nsometimes\nrarely\neach ...\n\n2. When we talk about facts and feelings\n\nI hate school!\nThe Earth goes around the Sun.\n\n3. For timetables\n\nWhen does the bus leave?\nIt leaves at 5.20pm.\n\nHow to build:\n\n1. Subject + Predicate (the verb is in the infinitive form when the subject is I, YOU, WE, THEY)\nWe wash our teeth every day.\n\n2. Subject + Predicate (verb with the suffix -S, when the subject is HE, SHE or IT)\nHe cleans his house once a month.\n\nWhen the verb ends in -ch, -sh, -s, -x, -z, -o, we add ES\n\nkissES, washES, watchES, buzzES, does, goes\n\nWhen the last letter is Y preceded by the consonant CRY - crIES\n(BUT play --- playS)\n\nException\nHAVE - HAS\n\n<strong>Future Simple</strong>\n\nWhen we use the Future Simple:\n\n1. When we make a decision in the moment\n\nWait. I'll help you.\nI'll call you later.\n\n2. When we try to predict something.\n\nWhat do you think, who will win?"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c36"
  },
  "language": "English",
  "parent": "Verbs",
  "name": "Conditionals",
  "text": "<strong>Zero Conditional</strong>\n\nA zero conditional is a type of conditional sentence that expresses a general truth or an inevitable result.\n\nHow to build:\n\nThe zero conditional consists of\nif / when + present simple >> present simple.\nBoth parts of the sentence are in the present simple tense.\nThe order of the sentence part doesn't matter, but if we start with the if / when part, then we put a comma after it.\n\nExamples:\na. If you heat water to 100 degrees, it boils.\nb. If you cut yourself, you bleed.\nc. When the sun goes down, it gets dark.\n\n<strong>First Conditional</strong>\n\nThe probability that something will happen if the condition in the if-clause is met is high, and that's why these are also called real sentences.\n\nHow to build:\n\nLike all conditional sentences, the first conditional consists of\nIf clause (if clause), which is most common in the Present Simple tense.\n\nExamples:\na. You will get good grades if you study hard.\nb. If you study hard, you'll get good grades.\n\n<strong>Second Conditional</strong>\n\nThe chances of the condition being fulfilled are very small or none, so we use it to give advice or when talking about hypothetical situations.\n\nIf I were you, I would go see a doctor.\nIf I won the lottery, I would buy a yacht.\n\nHow to build:\n\nThe second conditional also consists of two sentences:\nIf sentences that are in the Past Simple tense\nThe main clause, which is in the Conditional tense - conditional tense, that is, would+infinitive\n\nExample:\nIf I had a car, I would visit you!\n\n<strong>Third Conditional</strong>\n\nThe third conditional in English is a type of conditional sentence that expresses an impossible situation in the past and its hypothetical result.\nIt is used when we want to imagine what would have happened if something had been different in the past.\n\nFor example:\n• If I won the lottery, I would buy a house.\n• If you had listened to me, you wouldn't have hurt yourself.\n• If it was sunny, we would go to the beach.\n\nThe structure of the third conditional is:\nif + past perfect >> would have + past participle.\nBoth parts of the sentence are in the past tense.\nThe order of the sentence part does not matter, but if we start with the if part, then we put a comma after it."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c37"
  },
  "language": "English",
  "parent": "Numbers",
  "name": "Basic numbers",
  "text": "<strong>Basic Numbers</strong>\n\n1. For numbers over nine in English, digits are usually written in sentences:\n\nThere are five books on the table.\nI need 15 copies of the test.\n\n2. For numbers from 21 to 99, a dash is used between tens and units:\n\nFifty-seven people were in that plane.\n\n3. And is used for numbers over 100:\n\nOne hundred and seventeen books were delivered this morning."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c38"
  },
  "language": "English",
  "parent": "Numbers",
  "name": "Ordinal numbers",
  "text": "<strong>Ordinal numbers</strong>\n\nFirst - 1st\nSecond - 2nd\nThird - 3rd\nFourth - 4th\nfifth - 5th\n\nOnly the first three numbers in the English language do not end with the suffix -th.\n\ntwenty-first - 21st\ntwenty-second - 22nd\ntwenty-third - 23rd\ntwenty-fourth - 24th\nhundredth - 100th\nhundred and first - 101st\nhundred and fifty-second - 152nd"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c39"
  },
  "language": "English",
  "parent": "Numbers",
  "name": "Dates",
  "text": "<strong>Dates</strong>\n\nEnglish date writing is different from our date writing.\nThe period after the day, month and year is omitted.\nDays of the week and months are capitalized.\n\n1. Days of the week: Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday.\n\n2. Days of the month: they are marked with numbers 1-31.\nThe date is usually written as a base number (June 30, 30 June), and less often as an ordinal number.\nIn English sentences, a period is not used, but the appropriate suffix (1st, 2nd, 3rd, 30th..).\nIn both cases, the date is pronounced as an ordinal number.\n\n3. Months: January, February, March, April, May, June, July, August, September, October, November, December.\n\n4. Years: we can write as the whole year (1959) or abbreviated, using an apostrophe to replace the omitted part ('59).\nWhen expressing years in sentences, a full stop is not used. Examples:\n1900 - nineteen hundred\n1956 – nineteen fifty six\n2000 – the year two thousand\n2008 – two thousand (and) eight\n'67 - sixty seven\n\n5. Decades: before the decades we put the definite article the and an apostrophe, and after it the suffix 's'.\nThe '70s (read as 'the seventies').\n\n6. Centuries: centuries expressed in English is always preceded by the definite article the, and the number of centuries is ordinal!\nThe 21st century (c. / cent.)\n\n7. The era is divided into two eras:\na) Before Christ - before the new era: Before Christ (BC / B.C.)\nb) After Christ - new era: Anno Domini (AD / A.D.)"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c3a"
  },
  "language": "English",
  "parent": "Adjectives",
  "name": "Types",
  "text": "<strong>Types of Adjectives</strong>\n\nAdjectives are words that describe or modify nouns and pronouns.\nThere are several types of adjectives in the English language, and some of them are:\n\n<strong>Descriptive adjectives</strong> - describe the characteristics or qualities of someone or something.\nFor example: beautiful, smart, red, old..\n\n<strong>Comparative adjectives</strong> - compare two things by some characteristic.\nFor example: bigger, faster, more expensive..\n\n<strong>Superlative adjectives</strong> - show that something has the most or least of some qualities.\nFor example: biggest, fastest, most expensive..\n\n<strong>Coordinate adjectives</strong> - are two or more adjectives that describe the same noun and can be arranged in any order.\nFor example: a big, black dog or a black, big dog.\n\n<strong>Possessive adjectives</strong> - show belonging or possession of someone or something.\nFor example: my, your, his, her, its, our, their..\n\n<strong>Demonstrative adjectives</strong> - show which noun is meant or where it is located.\nFor example: this, that, these, those..\n\n<strong>Interrogative adjectives</strong> - are used to ask questions about nouns.\nFor example: which, what, whose.."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c3b"
  },
  "language": "English",
  "parent": "Adjectives",
  "name": "Comparation",
  "text": "<strong>Comparison of adjectives</strong>\n\nPositive\n\nAdjective comparison is a process used to compare the characteristics or qualities of someone or something.\nThere are three degrees of comparative adjectives: positive, comparative and superlative.\nFor example:\n\n• Positive: big, cold, happy, important, good\n• Comparative: bigger, colder, happier, more important, better\n• Superlative: the biggest, the coldest, the happiest, the most important, the best\n\nFor the formation of comparatives and superlatives, there are different rules depending on the number of syllables, the ending or irregularity of the adjective.\nHere are some of them:\n\n• For monosyllabic adjectives, we add the suffix -er for the comparative and -est for the superlative.\nIf the adjective ends in one vowel and one consonant, we double the last consonant.\nIf the adjective ends in -e, we only add -r or -st.\nFor example:\n\n• big - bigger - the biggest \n• hot - hotter - the hottest \n• nice - nicer - the nicest \n\n• For two-syllable adjectives ending in -y, we change the -y to -i and add the suffix -er or -est.\nFor other two-syllable and polysyllabic adjectives, we use sea or bridge before the adjective.\nFor example:\n\n• happy - happier - the happiest\n• boring - more boring - the most boring\n• beautiful - more beautiful - the most beautiful\n\n• Some adjectives have irregular comparison and do not follow these rules.\nFor example:\n\n• good - better - the best\n• bad - worse - the worst\n• far - farther/further - the farthest/furthest\n\nTo compare by equality, we use as ... as before the adjective.\nFor example:\n\n• She is as tall as her brother.\n• This book is not as interesting as the other one."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c3c"
  },
  "language": "English",
  "parent": "Articles",
  "name": "Definite article",
  "text": "<strong>The definite article THE</strong>\n\nUse:\n\n1. When we talk about certain, famous persons and things:\n\nThe girl you met is my friend.\nThe notebook on the desk is mine.\n\n2. Before superlatives:\n\nShe is the smartest girl in the class.\n\n3. Before ordinal numbers:\n\nThe first act of the play was the most interesting.\n\n4. Before concepts of which there is only one in the world:\n\nthe Earth, the past, the Sun, the weather\n\n5. Before the names of rivers, seas, oceans, mountain ranges:\n\nthe Danube, the Black sea, the Atlantic, the Alps\n\n6. In front of the name of a member of the nation, to indicate the entire nation:\n\nthe English, the Spanish\n\n7. Before the names of public buildings and institutions in the city:\n\nthe Odeon cinema, the National Museum, the Modern Art Gallery\n\n8. Before the name of the instruments:\n\nHe plays the piano."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c3d"
  },
  "language": "English",
  "parent": "Articles",
  "name": "Indefinite article",
  "text": "<strong>Indefinite articles A and AN</strong>\n\nNouns that begin with a consonant are preceded by the indefinite article, while nouns that begin with a vowel are preceded by the indefinite article an:\na book\nan elephant\n\nThey are used exclusively with singular nouns.\n\nUse:\n\n1. When talking about a person we do not know or whom we are mentioning for the first time:\n\nThere is a boy in the street.\n\n2. When we talk about a subject that we mention for the first time:\n\nShe put an apple on the table.\n\n3. Before the noun part of the predicate:\n\nI am a student."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c3e"
  },
  "language": "English",
  "parent": "Articles",
  "name": "No article",
  "text": "<strong>When no articles are used:</strong>\n\n1. Before the name of the language:\n\nShe speaks French.\n\n2. Before meals\n\nWe had lunch at three o'clock.\n\n3. Before sports and games:\n\nTom plays football very well.\n\n4. Before personal names and place names:\n\nJohn works in London.\n\n5. In many common expressions:\n\nby day, at night, at home, at work, in bed, by car..."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c3f"
  },
  "language": "English",
  "parent": "Pronouns",
  "name": "Personal pronouns",
  "text": "<strong>Subject Pronouns</strong>\n\n1. I – I am running. (I run.)\n2. You – You are running. (You run.)\n3. He – He is running. (He runs.)\n3. She – She is running. (She runs.)\n3. It – It is running. (It runs.)\n1. We – We are running. (We run.)\n2. You – You are running. (You run.)\n3. They – They are running. (They run.)\n\n<strong>Object Pronouns</strong>\n\nWhen personal pronouns have the function of an object in a sentence:\n\n1. Me – Tom is calling me. (Tom calls me.)\n2. You – Tom is calling you. (Tom is calling you.)\n3. Him – Tom is calling him. (Tom calls him.)\n4. Her – Tom is calling her. (Tom calls her.)\n5. It – Tom is calling it. (Tom calls it.)\n6. Us – Tom is calling us. (Tom calls us.)\n7. You – Tom is calling you. (Tom is calling you.)\n8. Them - Tom is calling them. (Tom calls them.)\n"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c40"
  },
  "language": "English",
  "parent": "Pronouns",
  "name": "Possessive pronouns",
  "text": "<strong>Possessive Pronouns</strong>\n\n<strong>The singular</strong>\n\nMine\nYours\nHis, hers, its\n\n<strong>Plural</strong>\n\nOurs\nYours\nTheirs\n\nPossessive adjectives are used with nouns, while possessive pronouns are used independently.\n\nHer jacket is white. - Adjective \nThis jacket is hers. - Pronoun\n\n"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c41"
  },
  "language": "Serbian",
  "parent": "Grammar Cases",
  "name": "Grammar Cases",
  "text": "Cases are different forms of a word that indicate their relationship to other words in a sentence.\nOnly nouns, pronouns, adjectives and some numbers (from one to four) can be changed by case.\nChanging the case of nouns is called declension.\n\nThere are seven cases in the Serbian language, in singular and plural:\n1. nominativ (nominative)\n2. genitiv (genitive)\n3. dativ (dative)\n4. akuzativ (accusative)\n5. vokativ (vocative)\n6. instrumental (instrumental)\n7. lokativ (locative)"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c42"
  },
  "language": "Serbian",
  "parent": "Grammar Cases",
  "name": "Questions",
  "text": "<strong>Case questions</strong>\n\nCase forms of the interrogative pronoun WHO (for living beings) or WHAT (for things) are used as a means of case identification:\n\n1. nominative: KO?, ŠTA? (WHO?, WHAT?)\n2. genitive: KOGA?, ČEGA? (WHO?, WHAT?)\n3. dative: KOME?, ČEMU? (TO WHO?, TO WHAT?)\n4. accusative: KOGA?, ŠTA? (WHO?, WHAT?)\n5. vocative: there is no question, it is obtained by exclaiming HEY!\n6. instrumental: S KIM?, (S) ČIM? (WITH WHOM?, WITH WHAT?)\n7. locative: O KOME?, O ČEMU? (ABOUT WHO?, ABOUT WHAT?)\n\nThe correct answer to these questions (except for the vocative, for which no question can be asked) gives the required case form of the noun.\n\nExamples\n\nChanging the words avion(plane), lopta(ball), selo(village) by cases:\n1. nom. – avion, lopta, selo\n2. gen. – aviona, lopte, sela\n3. dat. – avionu, lopti, selu\n4. ak. – avion, loptu, selo\n5. vok. – avione, lopto, selo\n6. instr. – avionom, loptom, selom\n7. lok. – avionu, lopti, selu"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c43"
  },
  "language": "Serbian",
  "parent": "Nouns",
  "name": "Division of nouns",
  "text": "The grammatical categories of nouns are gender, number and case.\nNouns change number and case, and have gender, but do not change it.\nEach noun has only one gender: either masculine or feminine or neuter.\n\n<strong>Division of nouns</strong>\n\n<strong>1.</strong> According to gender, nouns can be:\n\n1) masculine (can be spoken together with the word TAJ(that)), eg: brod-ship, kamen-stone, kamion-truck, lav-lion, mač-sword;\n2) feminine (can be spoken together with the word TA(that but feminine)), eg: baka-grandmother, mama-mom, livada-meadow, suza-tear;\n3) middle (can be spoken together with the word TO(that)), for example: drvo-tree, imanje-estate, jagnje-lamb, jezero-lake, more-sea, prase-pig, selo-village;\n\n<strong>2.</strong> According to the number, nouns can have the form:\n\n1) singular, eg: balon-balloon, krompir-potato, olovka-pencil, zgrada-building;\n2) plurals, eg: baloni-balloons, krompiri-potatoes, olovke-pencils, zgrade-buildings;\n\n<strong>3.</strong> According to meaning and characteristics, nouns can be:\n\n1) proper - they mean special names of certain living beings and geographical terms (country, city, ocean, sea, river, mountain, etc.)\nare written with a capital letter, eg: Philip, Jelena, Cameroon, Paris, Titicaca\nas a rule, they only have the singular form, and they can have the plural form when they denote several persons or terms with the same name\n\n2) common or general - denote a general name for living beings, objects and phenomena with common characteristics.\nas a rule, they have both singular and plural forms are written with a small initial letter \neg: guska/guske - goose/geese, torba/torbe - bag/bags\n\n3) collective - means a collection of beings or objects of the same kind \ni.e. a set in indefinite or unlimited number\neg: cveće-flowers, jagnjad-lambs, kamenje-stones, unučad-grandchildren, žbunje-bushes\n\n4) constructive - with the same form, they indicate both a small and a large amount of a substance, so they do not have a plural form\ne.g.: benzin-gasoline, inje-frost, mast-fat, med-honey, mleko-milk, sneg-snow, srebro-silver\nwhen they denote several types of a substance, they can be plural\n\n5) abstract or thought - denote the names of immaterial, intangible concepts, something that can only be felt or imagined\nfor example: ideja-idea, lepota-beauty, ljubav-love, mladost-youth, radost-joy, tuga-sadness"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c44"
  },
  "language": "Serbian",
  "parent": "Nouns",
  "name": "Natural and gramatical gender",
  "text": "<strong>Natural and grammatical gender of nouns</strong>\n\nWith nouns, we can talk about natural and grammatical gender.\nThe natural gender of nouns (masculine and feminine) depends on the gender of beings in nature (father, mother).\nNeuter nouns have no discernible difference between masculine and feminine gender.\n\nIf the noun denotes a living being, a distinction should be made between grammatical and natural gender.\nMasculine nouns denote male persons, while feminine nouns denote female persons.\nIn some cases, there is a discrepancy between grammatical and natural gender.\nSome nouns denoting persons of the male gender have masculine natural gender\n(avanturista-adventurer, deda-grandfather, karatista-karate player, sluga-servant, etc.), but are grammatically feminine.\n\nNouns that denote objects or phenomena have only grammatical gender.\nThat gender is determined, although not always, by the ending with which the noun ends.\nExample:\nfeminine: haljinA-dress, mamA-mom, suknjA-skirt..\nmasculine: gospodiN-gentleman, kreveT-bed...\nneuter: selO-willage, poljE-field, morE-sea..."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c45"
  },
  "language": "Serbian",
  "parent": "Nouns",
  "name": "Singularia tantum and pluralia tantum",
  "text": "<strong>Singularia tantum and pluralia tantum</strong>\n\nCertain nouns (proper and constructive) have only the singular form, they do not have a plural form.\nSuch nouns are called singularia tantum (Latin singularia tantum - only singular).\nfor example: Arandjelovac-Arandjelovac, Australija-Australia, Belgija-Belgium, ulje-oil, so-salt.\n\nCertain nouns only have a plural form, they do not have a singular form.\nSuch nouns are called pluralia tantum (Latin pluralia tantum - only plural)\neg: farmerke-jeans, grudi-chest, kola-car, ledja-back, makaze-scissors, merdevine-ladder, novine-newspaper\nThose nouns usually denote parts of the body or individual objects composed of at least two parts, and most often belong to the feminine or neuter plural.\nSuch nouns require plural verbs and adjectives."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c46"
  },
  "language": "Serbian",
  "parent": "Verbs",
  "name": "Impersonal verb forms",
  "text": "<strong>Impersonal verb forms</strong>\n\nThese verb forms do not change by person and do not have the meaning of predicativeness (they are not predicates).\nThe sentence contains verb clauses (adverbials) or attributes, and they can also be syntactic or lexical complements.\nAll impersonal verb forms belong to simple verb forms, and there are five of them:\n\n1) infinitiv-infinitive - names only the action, and does not say the person, time, or way of performing the action \n2) verb adjective active - denotes an action that was performed or performed in the past\n3) verb adjective trpni - means that someone or something has been subjected to some action\n4) past participle - indicates an action that was performed before some other action, i.e. expresses an action that happened before the action of the predicate\n5) present participle - indicates an action that is performed at the same time as another action, i.e. expresses an action simultaneous to the action of the predicate."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c47"
  },
  "language": "Serbian",
  "parent": "Verbs",
  "name": "Personal verb forms",
  "text": "<strong>Personal verb forms</strong>\n\nThese verb forms change by person and have the meaning of predicativeness, which is their true (indicative) meaning.\nSome verb forms, apart from their real meaning, also have wrong (relative) meanings, such as narrative and proverbial meanings.\nWhat happened in the past can be said, for the sake of a more colorful narration, not only in the perfect, but also in the present, aorist, future, etc.\n\nThere are nine personal verb forms, and they are divided into tenses (forms that have temporal meanings - they indicate past, present and future time; there are seven of them)\nand modes (forms that do not have temporal meanings, but indicate some unfulfilled action; there are two of them). This group of verb forms includes:\n\n1) Prezent-Present (present tense) – simple verb form that denotes an action that is performed at the same time when it is spoken about or constantly, all the time\n2) Perfekat-Perfect (past tense) – a complex verb form that says that the action was performed in the past, before the moment of speaking about it\n3) Imperfekat-Imperfect (past imperfect tense) – simple verb form that indicates an action that lasted for a long time in the past\n4) Pluskvamperfekat-Plusquamperfect (long past tense) – a complex verb form that indicates an action that was performed before some other past action\n5) Aorist - Aorist (past perfect tense) – a simple verb form that denotes a fast, dynamic action in the past, or an action that happened immediately before the moment in which it is spoken about\n6) Futur I - future I (future tense) - simple (one word : napisaću - I will write) or complex (two words : naći ćeš - you will find) verb form that indicates an action that will be performed in the future,\nafter the moment of speaking about it\n7) Futur II - Future II (pre-future tense) – complex verb form that expresses the speaker's assumption that the action will be performed in the future before some other future action or simultaneously with it\nfuture II is, in fact, a way (modus) and indicates a condition for the performance of some other action which, despite this, does not have to be realized\n8) Imperativ - Imperative (command mode) – a simple verb form that expresses a command or a desire to perform certain actionshas only 2nd person singular and 1st and 2nd person plural\n9) Potencijal - Potential (possible way) – a complex verb form that expresses the possibility or desire to perform or carry out an action\n\n<strong>For example</strong>\nThe verb forms of the verb gledati(to watch) are:\n\n1) Prezent:\n1. gledam / gledamo,\n2. gledaš / gledate,\n3. gleda / gledaju.\n\n2) Perfekat:\n1. gledao sam / gledali smo,\n2. gledao si / gledali ste,\n3. gledao je / gledali su.\n\n3) Imperfekat:\n1. gledijah / gledijasmo,\n2. gledijaše / gledijaste,\n3. gledijaše / gledijahu.\n\n4) Pluskvamperfekat:\n1. bejah gledio / bejasmo gledili,\n2. bejaše gledio / bejaste gledili,\n3. bejaše gledio / bejahu gledili;\nor,\n1. bio sam gledio / bili smo gledili,\n2. bio si gledio / bili ste gledili,\n3. bio je gledio / bili su gledili.\n\n5) Aorist:\n1. gledih / gledismo,\n2. gledi / glediste,\n3. gledi / glediše.\n\n6) Futur I:\n1. gledaću / gledaćemo,\n2. gledaćeš / gledaćete,\n3. gledaće / gledaće;\nor,\n1. ja ću gledati / mi ćemo gledati,\n2. ti ćeš gledati / vi ćete gledati,\n3. on će gledati / oni će gledati.\n\n7) Futur II:\n1. budem gledao / budemo gledali,\n2. budeš gledao / budete gledali,\n3. bude gledao / budu gledali.\n\n8) Imperativ:\n1. – / gledajmo,\n2. gledaj / gledajte,\n3. – / –.\n\n9) Potencijal:\n1. gledao bih / gledali bismo,\n2. gledao bi / gledali biste,\n3. gledao bi / gledali bi.\n\n"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c48"
  },
  "language": "Serbian",
  "parent": "Numbers",
  "name": "Basic numbers",
  "text": "The base numbers indicate how many terms there are.\nOnly the numbers one to four are variable according to case (one always, two quite rarely, three even more rarely, four quite rarely),\nand according to gender the numbers one and two (jedan/jedna/jedno - one; dva/dve/dva - two),\n\nChanging the numbers one, two, three and four by case:\n\n1. number one (masculine, feminine, neuter):\n• nom. – jedan, jedna, jedno\n• gen. – jednog(a), jedne, jednog(a)\n• dat. – jednom(e), jednoj, jednom(e)\n• ak. – jedan/jednog(a), jednu, jedno\n• vok. – jedan, jedna, jedno\n• instr. – jednim(e), jednom, jednim(e)\n• lok. – jednom(e), jednoj, jednom(e)\n\n2. number two (same for masculine and neuter):\n• nom. – dva, dve\n• gen. – dvaju, dveju\n• dat. – dvama, dvema\n• ak. – dva, dve\n• vok. – dva, dve\n• instr. – dvama, dvema\n• lok. – dvama, dvema\n\n3. number three (same for all three genders):\n• nom. – tri\n• gen. – triju\n• dat. – trima\n• ak. – tri\n• vok. – tri\n• instr. – trima\n• lok. – trima\n\n4. number four (same for all three genders):\n• nom. – četiri\n• gen. – četiriju\n• dat. – četirima\n• ak. – četiri\n• vok. – četiri\n• instr. – četirima\n• lok. – četirima"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c49"
  },
  "language": "Serbian",
  "parent": "Numbers",
  "name": "Ordinal numbers",
  "text": "Ordinal numbers indicate which order something is in. They change by gender, number and case.\n\n1. = prvi\n2. = drugi\n3. = treći\n4. = četvrti\n5. = peti\n6. = šesti\n7. = sedmi\n8. = osmi\n9. = deveti\n10. = deseti\n\nWe write: 1,2,3. and 4. but NO 1.,2.,3. and 4."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c4a"
  },
  "language": "Serbian",
  "parent": "Adjectives",
  "name": "Types",
  "text": "<strong>Adjectives</strong>\n\nAdjectives are non-independent words that stand next to a noun and define it more closely, i.e. they indicate some feature of the communicated concept.\nThey are of the same gender, number and case as the noun they stand next to.\nIn a sentence, they usually have the function of attribute and noun part of the predicate.\n\nAdjectives are the most commonly derived words.Derived adjectives are formed from noun bases and root adjectives to which suffixes are added.\nUnderived or root adjectives are univocal words and there are few of them in the Serbian language\n(eg beo-white, crn-black, lep-beautiful, brz-fast, lenj-lazy, mlad-young).\n\nAccording to the meaning, adjectives can be:\n1. descriptive - they indicate the characteristic of the noun they stand next to: visok-tall, srećan-happy, mračan-dark, pametan-smart, zelen-green\n2. possessive - indicate the belonging of the noun to which they stand: seoski-willage's, šabački-Sabac's, Petrov-Petar's, Ivanin-Ivana's \n3. building materials - indicate what the noun they stand next to is made of: glineni-clay, metalni-metal, vuneni-woolen, zlatni-golden\n4. temporal - denote a noun by time: mesečni-monthly\n5. mesni - indicate the place of the noun they stand next to: prednji-front, zadnji-back, gornji-top, donji-bottom, desni-right, južni-south.\n\nPossessive adjectives derived from proper nouns with the suffixes -OV, -EV, -IN are written with a capital letter (Filipov, Milošev, Jelenin),\nwhile possessive adjectives derived from proper nouns with the suffixes -SKI, -ŠKI, -ČKI are written with a small initial letter (mađarski, praški, kragujevački)."
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c4b"
  },
  "language": "Serbian",
  "parent": "Adjectives",
  "name": "Comparation",
  "text": "<strong>Comparation of adjectives</strong>\n\nOnly descriptive adjectives have a comparison, and their change according to the degree of the characteristic they denote is called a comparison.\nThe basic form of the adjective is called positive, and it has two degrees of comparison - comparative (first degree) and superlative (second degree).\n\nBeings, objects and phenomena can be compared according to whether some of their common features are more or less pronounced.\nIf that quality is only expressed by an adjective, then it is in the basic form - positive.\n\nIf with an adjective it is said that some characteristic is more strongly expressed in relation to the same characteristic of another term with which it is compared,\nthen the adjective is in the comparative form.\nThat form is built by adding the suffixes -iji, -ji, -ši to the positive, eg: blistaviji, grublji, lepši = brighter, rougher, more beautiful.\n\nThe suffix -ji does not occur in that form, but always causes the iota of the preceding consonant.\nIt comes on the basis of monosyllabic adjectives, mostly those with a long vowel in the base,\nfor example:brz – brži, drag – draži, mlad – mlađi, skup – skuplji = fast - faster, dear - dearer, young - younger, expensive - more expensive.\n\nThe suffix -ši has only three adjectives: lak – lakši, lep – lepši, mek – mekši = light - lighter, beautiful - more beautiful, soft - softer. \n\nIf with an adjective it is said that a characteristic is most strongly expressed in relation to the same characteristic of all the concepts with which it is compared,\nthen the adjective is in the superlative form.\nThat form is built by adding the prefix naj- to the comparative, for example: najblistaviji, najgrublji, najlepši = the brightest, the roughest, the most beautiful. \n\nThe prefix naj- is ​​usually written with a comparative.\nWhen an adjective begins with the consonant j, it is written twice, eg:najjači, najjasniji = the strongest, the clearest.\n\nFour adjectives have an irregular comparison (comparative and superlative with a modified or completely different base) and they are exceptions.\nThey are: dobar-good, zao-bad, mali-little, velik-big\n\n1. dobar – bolji – najbolji\n2. zao – gori – najgori\n3. mali – manji – najmanji\n4. velik – veći – najveći"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c4c"
  },
  "language": "Serbian",
  "parent": "Pronouns",
  "name": "Personal pronouns",
  "text": "<strong>Personal pronouns</strong>\n\nPersonal pronouns have gender (masculine, feminine and neuter) and number (singular and plural).\nThey are:\n\n1) singular: \n1. ja - I\n2. ti - you\n3. on, ona, ono - he, she, it\n\n2) plural:\n1. mi - we\n2. vi - you\n3. oni, one, ona -they"
},
{
  "_id": {
    "$oid": "66e034c674dce48545f70c4d"
  },
  "language": "Serbian",
  "parent": "Pronouns",
  "name": "Possessive pronouns",
  "text": "<strong>Possessive pronouns</strong>\n\nPossessive pronouns show who belongs to what the noun they stand for belongs to.\nThey are obtained by asking ČIJI?, ČIJA?, ČIJE? - WHOSE?\nThey are:\n\n1) singular:\n• moj, moja, moje - my\n• tvoj, tvoja, tvoje - your\n• njegov, njegova, njegovo, njen, njena, njeno -his, hers, its\n\n2) plural:\n• naš, naša, naše - our\n• vaš, vaša, vaše - your\n• njihov, njihova, njihovo - their"
}]